package com.cars.simple.service.threadpool;
import java.util.TimerTask;

/*******************************************************************
 * 文件名称	: TaskObject.java
 * 作	者	: fushangbin
 * 创建时间	: 
 * 文件描述	: 请求任务接口
 ******************************************************************/
public interface TaskObject {
	/**
	 * 任务请求响应通知码：任务执行成功
	 */
	public static final int RESPONSE_SUCCESS = 0;
	
	/**
	 * 任务请求响应通知码：任务超时（未执行）
	 */
	public static final int RESPONSE_TIMEOUT_ONRUN = 1;
	
	/**
	 * 任务请求响应通知码：任务超时（正在执行）
	 */
	public static final int RESPONSE_TIMEOUT_RUNNING = 2;
	
	/*******************************************************************
	 * 函数名称	: runTask
	 * 函数描述	: 任务执行体接口方法
	 * 输入参数	: N/A
	 * 输出参数	: void
	 * 返回值  	: void
	 * 备注		: N/A
	 ******************************************************************/
	public void runTask() throws InterruptedException ;
	
	/*******************************************************************
	 * 函数名称	: onCancelTask
	 * 函数描述	: 任务取消的回调接口方法，供线程管理模块调用
	 * 输入参数	: N/A
	 * 输出参数	: void
	 * 返回值  	: void
	 * 备注		: N/A
	 ******************************************************************/
	public void onCancelTask();
	
	/*******************************************************************
	 * 函数名称	: response
	 * 函数描述	: 任务请求响应回调接口
	 * 输入参数	: code  ----  任务请求响应通知码 
	 * 输出参数	: void
	 * 返回值  	: void
	 * 备注		: N/A
	 ******************************************************************/
	public void onTaskResponse(int code);
	
	/*******************************************************************
	 * 函数名称	: setTimeoutTask
	 * 函数描述	: 设置任务的超时定时器任务对象
	 * 输入参数	: @param timeoutTask  ----  定时器任务对象
	 * 输出参数	: void
	 * 返回值  	: void
	 * 备注		: 设置的对象是用来检测任务请求处理是否超时的定时器任务
	 ******************************************************************/
	public void setTimeoutTask(TimerTask timeoutTask);
	
	/*******************************************************************
	 * 函数名称	: startTimeoutTimer
	 * 函数描述	: 启动超时定时器
	 * 输入参数	: N/A
	 * 输出参数	: void
	 * 返回值  	: void
	 * 备注		: N/A
	 ******************************************************************/
	public void startTimeoutTimer();
	
	/*******************************************************************
	 * 函数名称	: stopTimeoutTimer
	 * 函数描述	: 停止超时定时器
	 * 输入参数	: N/A
	 * 输出参数	: void
	 * 返回值  	: void
	 * 备注		: N/A
	 ******************************************************************/
	public void stopTimeoutTimer();
	
	/****************************************************************************************
	 * 函数名称：setTimeStamp
	 * 函数描述：设置task 的时间戳
	 * 输入参数：@param time
	 * 输出参数：
	 * 返回    值：void
	 * 备         注：
	 ****************************************************************************************/
	public void setTimeStamp(int id);
	
	/****************************************************************************************
	 * 函数名称：getTimeStamp
	 * 函数描述：返回任务的时间戳
	 * 输入参数：@return
	 * 输出参数：
	 * 返回    值：long
	 * 备         注：
	 ****************************************************************************************/
	public int getTimeStamp();

}
